app/views/userphotos/index.html.erb

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---

    <% if !(Userphoto.find_by(user_id: current_user.id))%>