app/controllers/messajcontroller_controller.rb

  def create
        if(params[:message])
           Mesajlar.create(mesaj: params[:message], user_id: current_user.id)
---
INSERT INTO "mesajlars" ("mesaj", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["mesaj", "Merhaba"], ["created_at", "2019-05-17 23:24:04.247904"], ["updated_at", "2019-05-17 23:24:04.247904"], ["user_id", 2]]