app/controllers/online_oda_controller.rb

  def index
      @mesajlar = Mesajlar.all
---
SELECT "mesajlars".* FROM "mesajlars"