app/controllers/userphotos_controller.rb

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @userphotos = Userphoto.where(user_id: current_user.id)

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
INSERT INTO "userphotos" ("alt", "created_at", "updated_at", "resim_file_name", "resim_content_type", "resim_file_size", "resim_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    if !(Userphoto.find_by(user_id: current_user.id))
        @userphoto = Userphoto.new(userphoto_params)
        @userphoto.user_id=current_user.id
        respond_to do |format|
          if @userphoto.save

UPDATE "userphotos" SET "resim_file_name" = ?, "resim_updated_at" = ?, "updated_at" = ? WHERE "userphotos"."id" = ?  [["resim_file_name", "pp.jpg"], ["resim_updated_at", "2019-05-17 22:38:55.773185"], ["updated_at", "2019-05-17 22:38:55.929172"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @userphoto.update(userphoto_params)

DELETE FROM "userphotos" WHERE "userphotos"."id" = ?  [["id", 1]]
---
  def destroy
    @userphoto.destroy

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_userphoto
      @userphoto = Userphoto.find(params[:id])