app/views/online_oda/index.html.erb

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
        						                <div class="img_cont_msg">
                								    <% if(Userphoto.find_by(user_id: current_user)) %>
                								        <img src="<%= image_path(Userphoto.find_by(user_id: current_user.id).resim)%>" class="rounded-circle user_img_msg">

SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]
SELECT  "userphotos".* FROM "userphotos" WHERE "userphotos"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
        						                <div class="img_cont_msg">
                								    <% if(Userphoto.find_by(user_id: mesaj.user_id)) %>
                								        <img src="<%= image_path(Userphoto.find_by(user_id: mesaj.user_id).resim)%>" class="rounded-circle user_img_msg">

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
                									<%= mesaj.mesaj%> </br>
                									<span class="msg_time" style="min-width:200px;"><b><%= User.find_by(id: mesaj.user_id).email%></b> <%= mesaj.created_at%></span>